src/data_analysis/collected_data/watermelon/api/standarda8v2/g/load.txt
Running 30m test @ http://20.117.90.82:60
  2 threads and 1000 connections
  Thread calibration: mean lat.: 2943.317ms, rate sampling interval: 11116ms
  Thread calibration: mean lat.: 3008.627ms, rate sampling interval: 11436ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.03m     5.17m   18.00m    57.90%
    Req/Sec   397.99     19.46   425.00     86.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.01m 
 75.000%   13.48m 
 90.000%   16.20m 
 99.000%   18.00m 
 99.900%   18.56m 
 99.990%   18.84m 
 99.999%   18.98m 
100.000%   19.10m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     242.303     0.000000            1         1.00
  113377.279     0.100000       142636         1.11
  220725.247     0.200000       285415         1.25
  327417.855     0.300000       427981         1.43
  435159.039     0.400000       570791         1.67
  540540.927     0.500000       713070         2.00
  594018.303     0.550000       784406         2.22
  648019.967     0.600000       856142         2.50
  702545.919     0.650000       927367         2.86
  756023.295     0.700000       998788         3.33
  808976.383     0.750000      1069702         4.00
  836763.647     0.775000      1105541         4.44
  864026.623     0.800000      1141596         5.00
  890765.311     0.825000      1177171         5.71
  918028.287     0.850000      1212856         6.67
  944766.975     0.875000      1248441         8.00
  958398.463     0.887500      1266229         8.89
  972029.951     0.900000      1284063        10.00
  985661.439     0.912500      1301757        11.43
  999292.927     0.925000      1319453        13.33
 1012400.127     0.937500      1337028        16.00
 1019215.871     0.943750      1345994        17.78
 1026555.903     0.950000      1355427        20.00
 1033371.647     0.956250      1364072        22.86
 1040187.391     0.962500      1372698        26.67
 1047527.423     0.968750      1381723        32.00
 1051721.727     0.971875      1386545        35.56
 1055916.031     0.975000      1391023        40.00
 1059586.047     0.978125      1394925        45.71
 1064828.927     0.981250      1399826        53.33
 1069547.519     0.984375      1404055        64.00
 1072168.959     0.985938      1406207        71.11
 1074790.399     0.987500      1408303        80.00
 1077936.127     0.989062      1410709        91.43
 1081081.855     0.990625      1412915       106.67
 1085276.159     0.992188      1415513       128.00
 1086324.735     0.992969      1416115       142.22
 1088421.887     0.993750      1417257       160.00
 1090519.039     0.994531      1418351       182.86
 1093664.767     0.995313      1419680       213.33
 1096810.495     0.996094      1420886       256.00
 1097859.071     0.996484      1421290       284.44
 1099956.223     0.996875      1421969       320.00
 1101004.799     0.997266      1422294       365.71
 1103101.951     0.997656      1422839       426.67
 1106247.679     0.998047      1423538       512.00
 1107296.255     0.998242      1423759       568.89
 1108344.831     0.998437      1423990       640.00
 1109393.407     0.998633      1424176       731.43
 1111490.559     0.998828      1424523       853.33
 1113587.711     0.999023      1424798      1024.00
 1114636.287     0.999121      1424918      1137.78
 1115684.863     0.999219      1425053      1280.00
 1116733.439     0.999316      1425168      1462.86
 1117782.015     0.999414      1425276      1706.67
 1119879.167     0.999512      1425464      2048.00
 1120927.743     0.999561      1425558      2275.56
 1120927.743     0.999609      1425558      2560.00
 1121976.319     0.999658      1425632      2925.71
 1123024.895     0.999707      1425696      3413.33
 1125122.047     0.999756      1425801      4096.00
 1125122.047     0.999780      1425801      4551.11
 1126170.623     0.999805      1425841      5120.00
 1127219.199     0.999829      1425871      5851.43
 1128267.775     0.999854      1425897      6826.67
 1129316.351     0.999878      1425927      8192.00
 1130364.927     0.999890      1425964      9102.22
 1130364.927     0.999902      1425964     10240.00
 1131413.503     0.999915      1425989     11702.86
 1132462.079     0.999927      1426012     13653.33
 1132462.079     0.999939      1426012     16384.00
 1133510.655     0.999945      1426026     18204.44
 1134559.231     0.999951      1426037     20480.00
 1134559.231     0.999957      1426037     23405.71
 1135607.807     0.999963      1426049     27306.67
 1136656.383     0.999969      1426068     32768.00
 1136656.383     0.999973      1426068     36408.89
 1136656.383     0.999976      1426068     40960.00
 1136656.383     0.999979      1426068     46811.43
 1137704.959     0.999982      1426079     54613.33
 1137704.959     0.999985      1426079     65536.00
 1137704.959     0.999986      1426079     72817.78
 1137704.959     0.999988      1426079     81920.00
 1138753.535     0.999989      1426086     93622.86
 1138753.535     0.999991      1426086    109226.67
 1138753.535     0.999992      1426086    131072.00
 1139802.111     0.999993      1426091    145635.56
 1139802.111     0.999994      1426091    163840.00
 1139802.111     0.999995      1426091    187245.71
 1139802.111     0.999995      1426091    218453.33
 1139802.111     0.999996      1426091    262144.00
 1140850.687     0.999997      1426092    291271.11
 1140850.687     0.999997      1426092    327680.00
 1142947.839     0.999997      1426093    374491.43
 1142947.839     0.999998      1426093    436906.67
 1143996.415     0.999998      1426095    524288.00
 1143996.415     0.999998      1426095    582542.22
 1143996.415     0.999998      1426095    655360.00
 1143996.415     0.999999      1426095    748982.86
 1143996.415     0.999999      1426095    873813.33
 1143996.415     0.999999      1426095   1048576.00
 1143996.415     0.999999      1426095   1165084.44
 1143996.415     0.999999      1426095   1310720.00
 1146093.567     0.999999      1426096   1497965.71
 1146093.567     1.000000      1426096          inf
#[Mean    =   542056.778, StdDeviation   =   310174.315]
#[Max     =  1145044.992, Total count    =      1426096]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1433080 requests in 30.00m, 667.46MB read
  Socket errors: connect 0, read 66, write 596, timeout 16258
  Non-2xx or 3xx responses: 4
Requests/sec:    796.16
Transfer/sec:    379.71KB